---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.Station
source: html/215afd0a-ff0e-1a8e-fc74-be36e7ad4d77.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.Station Property

Specifies the station at which the label will be placed, in Revit internal model units (standard Imperial feet).
 The station determines the location of the label's origin: Origin
 by setting it to the closest point on the alignment geometry which corresponds to this station.

## Syntax (C#)
```csharp
public double Station { get; set; }
```